---
kind: type
id: T:Autodesk.Revit.DB.ElementIntersectsFilter
source: html/b9e3bdcb-e85a-832d-0f51-312b3fd91cff.htm
---
# Autodesk.Revit.DB.ElementIntersectsFilter

A base class for filters used to match elements which intersect with geometry.

## Syntax (C#)
```csharp
public class ElementIntersectsFilter : ElementSlowFilter
```